In [98]:
import pandas as pd
# https://docs.google.com/spreadsheets/d/1OdjccfGlv3lsuiWgIAHbE8id91FpVaU2EsaZo5kknaA/edit?usp=sharing
import numpy as np

In [99]:

from io import BytesIO
import requests
spreadsheet_id = '1OdjccfGlv3lsuiWgIAHbE8id91FpVaU2EsaZo5kknaA'
file_name = 'https://docs.google.com/spreadsheets/d/{}/export?format=csv'.format(spreadsheet_id)
r = requests.get(file_name)
train = pd.read_csv(BytesIO(r.content))

In [100]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19104 entries, 0 to 19103
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   MMM-YY                19104 non-null  object
 1   Emp_ID                19104 non-null  int64
 2   Age                   19104 non-null  int64
 3   Gender                19104 non-null  object
 4   City                  19104 non-null  object
 5   Education_Level       19104 non-null  object
 6   Salary                19104 non-null  int64
 7   Dateofjoining         19104 non-null  object
 8   LastWorkingDate       1616 non-null   object
 9   Joining Designation   19104 non-null  int64
 10  Designation           19104 non-null  int64
 11  Total Business Value  19104 non-null  int64
 12  Quarterly Rating      19104 non-null  int64
dtypes: int64(7), object(6)
memory usage: 1.9+ MB

In [101]:
def get_info(df):

    print("Head:")
    display(df.head())
    print()
    
    print("Info:")
    display(df.info())
    print()
    
    print("Description of quantitative parameters:")
    display(df.describe())
    print()
    
    print("Description of categorical parameters:")
    display(df.describe(include='object'))
    print()
    
    print("Columns with NaN values:")
    display(df.isna().sum())
    print()
    
    print("Shape:")
    display(df.shape)
    print()
    
    print("Number of duplicated rows:")
    display(df.duplicated().sum())

In [102]:
get_info(train)

Head:

Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19104 entries, 0 to 19103
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   MMM-YY                19104 non-null  object
 1   Emp_ID                19104 non-null  int64
 2   Age                   19104 non-null  int64
 3   Gender                19104 non-null  object
 4   City                  19104 non-null  object
 5   Education_Level       19104 non-null  object
 6   Salary                19104 non-null  int64
 7   Dateofjoining         19104 non-null  object
 8   LastWorkingDate       1616 non-null   object
 9   Joining Designation   19104 non-null  int64
 10  Designation           19104 non-null  int64
 11  Total Business Value  19104 non-null  int64
 12  Quarterly Rating      19104 non-null  int64
dtypes: int64(7), object(6)
memory usage: 1.9+ MB

Description of quantitative parameters:

Description of categorical parameters:

Columns with NaN values:

Shape:

Number of duplicated rows:

,MMM-YY,Emp_ID,Age,Gender,City,Education_Level,Salary,Dateofjoining,LastWorkingDate,Joining Designation,Designation,Total Business Value,Quarterly Rating
0,2016-01-01,1,28,Male,C23,Master,57387,2015-12-24,NaN,1,1,2381060,2
1,2016-02-01,1,28,Male,C23,Master,57387,2015-12-24,NaN,1,1,-665480,2
2,2016-03-01,1,28,Male,C23,Master,57387,2015-12-24,2016-03-11,1,1,0,2
3,2017-11-01,2,31,Male,C7,Master,67016,2017-11-06,NaN,2,2,0,1
4,2017-12-01,2,31,Male,C7,Master,67016,2017-11-06,NaN,2,2,0,1

None

,Emp_ID,Age,Salary,Joining Designation,Designation,Total Business Value,Quarterly Rating
count,19104.000000,19104.000000,19104.000000,19104.000000,19104.000000,1.910400e+04,19104.000000
mean,1415.591133,34.650283,65652.025126,1.690536,2.252670,5.716621e+05,2.008899
std,810.705321,6.264471,30914.515344,0.836984,1.026512,1.128312e+06,1.009832
min,1.000000,21.000000,10747.000000,1.000000,1.000000,-6.000000e+06,1.000000
25%,710.000000,30.000000,42383.000000,1.000000,1.000000,0.000000e+00,1.000000
50%,1417.000000,34.000000,60087.000000,1.000000,2.000000,2.500000e+05,2.000000
75%,2137.000000,39.000000,83969.000000,2.000000,3.000000,6.997000e+05,3.000000
max,2788.000000,58.000000,188418.000000,5.000000,5.000000,3.374772e+07,4.000000

            MMM-YY Gender   City Education_Level Dateofjoining LastWorkingDate
count        19104  19104  19104           19104         19104            1616
unique          24      2     29               3           869             493
top     2016-01-01   Male    C20        Bachelor    2012-07-23      2017-07-29
freq          1022  11103   1008            6864           192              70

MMM-YY                      0
Emp_ID                      0
Age                         0
Gender                      0
City                        0
Education_Level             0
Salary                      0
Dateofjoining               0
LastWorkingDate         17488
Joining Designation         0
Designation                 0
Total Business Value        0
Quarterly Rating            0
dtype: int64

(19104, 13)

0

# Processing Dates:
We have added LastMonthOnWork (datetime feature) and MonthsTillLast (int feature)

In [103]:
train['date'] = pd.to_datetime(train['MMM-YY'], format='%Y-%m-%d')
train['LastWorkingDate'] = pd.to_datetime(train['LastWorkingDate'], format='%Y-%m-%d')

print(train.date.min(), train.date.max())
# max_date = pd.datetime.today()  # to adapt easier for other datetime windows
max_date = train.date.max()
min_date = train.date.min()

# we are adding 3 days before getting month so that dates in the end of the month were rounded to the next month.
# this is done because for persons whose LastWorkingDate is in the last 1-3 days there exists a data entry on the next month
train['LastWorkingDate'] = train['LastWorkingDate'].fillna(max_date)
train['LastWorkingDate'] = train.groupby('Emp_ID')['LastWorkingDate'].transform('min')
train['LastMonthOnWork'] = (train['LastWorkingDate'] + pd.Timedelta(days=3)).dt.to_period('M').dt.to_timestamp()
train['MonthsTillLast'] = ((train.LastMonthOnWork - train.date)/np.timedelta64(1, 'M')).round().astype(int)

2016-01-01 00:00:00 2017-12-01 00:00:00

In [104]:
get_info(train)

Head:

Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19104 entries, 0 to 19103
Data columns (total 16 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   MMM-YY                19104 non-null  object
 1   Emp_ID                19104 non-null  int64
 2   Age                   19104 non-null  int64
 3   Gender                19104 non-null  object
 4   City                  19104 non-null  object
 5   Education_Level       19104 non-null  object
 6   Salary                19104 non-null  int64
 7   Dateofjoining         19104 non-null  object
 8   LastWorkingDate       19104 non-null  datetime64[ns]
 9   Joining Designation   19104 non-null  int64
 10  Designation           19104 non-null  int64
 11  Total Business Value  19104 non-null  int64
 12  Quarterly Rating      19104 non-null  int64
 13  date                  19104 non-null  datetime64[ns]
 14  LastMonthOnWork       19104 non-null  datetime64[ns]
 15  MonthsTillLast        19104 non-null  int64
dtypes: datetime64[ns](3), int64(8), object(5)
memory usage: 2.3+ MB

Description of quantitative parameters:

Description of categorical parameters:

Columns with NaN values:

Shape:

Number of duplicated rows:

,MMM-YY,Emp_ID,Age,Gender,City,Education_Level,Salary,Dateofjoining,LastWorkingDate,Joining Designation,Designation,Total Business Value,Quarterly Rating,date,LastMonthOnWork,MonthsTillLast
0,2016-01-01,1,28,Male,C23,Master,57387,2015-12-24,2016-03-11,1,1,2381060,2,2016-01-01,2016-03-01,2
1,2016-02-01,1,28,Male,C23,Master,57387,2015-12-24,2016-03-11,1,1,-665480,2,2016-02-01,2016-03-01,1
2,2016-03-01,1,28,Male,C23,Master,57387,2015-12-24,2016-03-11,1,1,0,2,2016-03-01,2016-03-01,0
3,2017-11-01,2,31,Male,C7,Master,67016,2017-11-06,2017-12-01,2,2,0,1,2017-11-01,2017-12-01,1
4,2017-12-01,2,31,Male,C7,Master,67016,2017-11-06,2017-12-01,2,2,0,1,2017-12-01,2017-12-01,0

None

,Emp_ID,Age,Salary,Joining Designation,Designation,Total Business Value,Quarterly Rating,MonthsTillLast
count,19104.000000,19104.000000,19104.000000,19104.000000,19104.000000,1.910400e+04,19104.000000,19104.000000
mean,1415.591133,34.650283,65652.025126,1.690536,2.252670,5.716621e+05,2.008899,6.457077
std,810.705321,6.264471,30914.515344,0.836984,1.026512,1.128312e+06,1.009832,6.107351
min,1.000000,21.000000,10747.000000,1.000000,1.000000,-6.000000e+06,1.000000,0.000000
25%,710.000000,30.000000,42383.000000,1.000000,1.000000,0.000000e+00,1.000000,2.000000
50%,1417.000000,34.000000,60087.000000,1.000000,2.000000,2.500000e+05,2.000000,4.000000
75%,2137.000000,39.000000,83969.000000,2.000000,3.000000,6.997000e+05,3.000000,10.000000
max,2788.000000,58.000000,188418.000000,5.000000,5.000000,3.374772e+07,4.000000,23.000000

            MMM-YY Gender   City Education_Level Dateofjoining
count        19104  19104  19104           19104         19104
unique          24      2     29               3           869
top     2016-01-01   Male    C20        Bachelor    2012-07-23
freq          1022  11103   1008            6864           192

MMM-YY                  0
Emp_ID                  0
Age                     0
Gender                  0
City                    0
Education_Level         0
Salary                  0
Dateofjoining           0
LastWorkingDate         0
Joining Designation     0
Designation             0
Total Business Value    0
Quarterly Rating        0
date                    0
LastMonthOnWork         0
MonthsTillLast          0
dtype: int64

(19104, 16)

0

# Checking for strange behaviour in dates:

In [105]:
train[train['MonthsTillLast'] == -1].head(20)

Empty DataFrame
Columns: [MMM-YY, Emp_ID, Age, Gender, City, Education_Level, Salary, Dateofjoining, LastWorkingDate, Joining Designation, Designation, Total Business Value, Quarterly Rating, date, LastMonthOnWork, MonthsTillLast]
Index: []

In [106]:
print(len(train[train['MonthsTillLast'] == -1]))

0

In [107]:
# train[train['LastWorkingDate'] < train['date']].head(20)

In [108]:
# print(len(train[train['LastWorkingDate'] < train['date'].dt.to_period('M').dt.to_timestamp()]))

In [109]:
date_overflow = train[(train['LastWorkingDate'] < train['date'].dt.to_period('M').dt.to_timestamp())]
# print(date_overflow)

In [110]:
date_diff = date_overflow['LastWorkingDate'] - date_overflow['date']
print(date_diff.min(), date_diff.max())

-3 days +00:00:00 -1 days +00:00:00

## Remove users that are working (not resigned) but have no data for the last month):
(ids are calculated in Sveta's code):

In [111]:
no_records_ids = [66, 383, 612, 743, 755, 770, 920, 1173, 1224, 1339, 1437, 1449, 1454, 1561, 1629, 1663, 1706, 1758, 1893, 1894, 2132, 2268, 2547, 2685]

no_records_users = train[train['Emp_ID'].isin(no_records_ids)]

train_clean = train[~train['Emp_ID'].isin(no_records_ids)]

# pd.set_option('display.max_rows', None)
# no_records_users

# Generate new dataset with a single row for each user

In [113]:
# train_clean.set_index(['Emp_ID', 'MonthsTillLast']).T
# train_clean.set_index(['MonthsTillLast']).T
# df = df.pivot_table(index=['id','obs_week'], columns='weeks_id', aggfunc=sum, fill_value=0)
# df.columns = ['{}_{}'.format(x[0], x[1]) for x in df.columns]
# df = df.reset_index().rename_axis(None, axis=1)

emp_train = train_clean[train_clean['MonthsTillLast'] <= 12].pivot_table(index=['Emp_ID'], 
                                    columns=['MonthsTillLast'], 
                                    values=['Total Business Value', 'Quarterly Rating'])
emp_train.columns = [f'{x[0]}_{x[1]}' for x in emp_train.columns]
emp_train = emp_train.reset_index().rename_axis(None, axis=1)
emp_train = emp_train.set_index('Emp_ID').rename_axis(None)   
for i in range(1, 13):
    emp_train[f'Quarterly Rating_{i}'] = emp_train[f'Quarterly Rating_{i}'].fillna(emp_train[f'Quarterly Rating_{i-1}'])       
    emp_train[f'Total Business Value_{i}'] = emp_train[f'Total Business Value_{i}'].fillna(emp_train[f'Total Business Value_{i-1}'])       
emp_train.head(20)

,Quarterly Rating_0,Quarterly Rating_1,Quarterly Rating_2,Quarterly Rating_3,Quarterly Rating_4,Quarterly Rating_5,Quarterly Rating_6,Quarterly Rating_7,Quarterly Rating_8,Quarterly Rating_9,...,Total Business Value_3,Total Business Value_4,Total Business Value_5,Total Business Value_6,Total Business Value_7,Total Business Value_8,Total Business Value_9,Total Business Value_10,Total Business Value_11,Total Business Value_12
1,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,...,2381060.0,2381060.0,2381060.0,2381060.0,2381060.0,2381060.0,2381060.0,2381060.0,2381060.0,2381060.0
2,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
5,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
6,2.0,2.0,2.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
8,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
11,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
12,1.0,1.0,1.0,4.0,4.0,4.0,4.0,4.0,4.0,4.0,...,400000.0,1707180.0,500000.0,500000.0,500000.0,500000.0,500000.0,500000.0,500000.0,500000.0
13,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,500000.0,150000.0,258610.0,400000.0,0.0,1593590.0,200000.0,151110.0,300000.0,200000.0
14,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
16,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,346800.0,346800.0,346800.0,346800.0,346800.0,346800.0,346800.0,346800.0,346800.0,346800.0
17,1.0,1.0,1.0,1.0,2.0,2.0,2.0,2.0,2.0,2.0,...,242650.0,674990.0,0.0,100000.0,100000.0,100000.0,100000.0,100000.0,100000.0,100000.0
18,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
20,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
21,1.0,1.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,...,0.0,150600.0,520980.0,0.0,150450.0,533260.0,116350.0,0.0,3295370.0,551740.0
22,1.0,2.0,2.0,2.0,3.0,3.0,3.0,4.0,4.0,4.0,...,500510.0,499480.0,306410.0,200000.0,696920.0,1120560.0,653680.0,121590.0,635700.0,601680.0
24,2.0,3.0,3.0,3.0,2.0,2.0,2.0,2.0,2.0,2.0,...,203240.0,97220.0,128730.0,312720.0,1103240.0,401310.0,106460.0,106460.0,106460.0,106460.0
25,4.0,4.0,4.0,4.0,4.0,4.0,3.0,3.0,3.0,4.0,...,1368060.0,1512060.0,650000.0,1219340.0,350000.0,-414250.0,3053510.0,2973000.0,2109420.0,574040.0
26,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,4.0,...,440550.0,1710410.0,153590.0,0.0,970030.0,1940050.0,9226690.0,1511840.0,732410.0,1086370.0
29,1.0,1.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,...,278930.0,231840.0,231840.0,231840.0,231840.0,231840.0,231840.0,231840.0,231840.0,231840.0